title: TestSigmaRedCanary155_228
description: "test rule2"
references:
- https://github.com/fox-it/adconnectdump
- https://o365blog.com/post/adsync/
- https://dirkjanm.io/updating-adconnectdump-a-journey-into-dpapi/
tags:
- attack.credential_access
- attack.t1555
author: "KK"
status: "testing"
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventID: 14720987669
    RelativeTargetName|contains: \xfhgkj\retuyi\ADSync\mnbvc\sdfhg\utyrfd\fgh\
  selection2:
    EventID: 1473456769
  selection3:
    EventID: 147436789369
  condition: selection1 and selection2 or selection3
fields:
- ""
falsepositives:
- None
level: "low"
